Repository: common-repository/taxonomy-admin-filter
Catalog: languages/taxonomy_admin_filter-*.po
Languages: ro_ro

source: Assigned to current post type
ro_ro: Asociate la tipul de articol curent

source: Assigned to other post types
ro_ro: Asociate la alte tipuri de articol

source: Taxonomy admin filter settings
ro_ro: Setări filtre taxonomii

source: Confirm reset
ro_ro: Confirmare resetare

source: Resetting..
ro_ro: Se resetează..

source: Choose in which taxonomy admin page box show filter field. Change "hide filter" checkbox if you want to hide filter field if taxonomy has no values. You can enable a taxonomy filter by checking his checkbox input beside taxonomy names.
ro_ro: Alegeți care din taxonomii suportă aceasta filtrare. Bifați caseta "Ascunde filtrul" dacă nu doriți afișarea filtrului dacă taxonomia nu conține valori. Puteți activa filtrul pentru o taxonomie bifând caseta din dreptul numelui taxonomiei.

source: When you enable a taxonomy filter, a section for choosing hidden taxonomy terms is displayed in every WordPress user profile's settings page. In that page you can select a list of taxonomy terms that are automatically removed from hierarchical term taxonomies inside admin pages.
ro_ro: Când activați filtrul unei taxonomii, în pagina de setări profil utilizator veți avea posibilitatea de a alege termeni de taxonomie ce vor fi ascunși utilizatorului respectiv în listele ierarhice ale taxonomiei în paginile de administrare.

source: Note: The plugin does not support non-hierarchical tags.
ro_ro: Nota: Pluginul nu suportă taguri non-ierarhice.

source: Save
ro_ro: Salvare

source: Reset
ro_ro: Resetare

source: Select2 javascript URL
ro_ro: URL javascript Select2

source: Default
ro_ro: Implicit

source: Custom URL
ro_ro: URL personalizat

source: Please enter the Select2 Javascript file full URL. E.g.
ro_ro: Introduceți URL-ul întreg către fișierul Javascript Select2

source: Select2 css URL
ro_ro: URL CSS Select2

source: Please enter the Select2 CSS file full URL. E.g.
ro_ro: Introduceți URL-ul întreg către fișierul CSS Select2

source: Name
ro_ro: Nume

source: Slug
ro_ro: Alias

source: Rewrite slug
ro_ro: Rescriere alias

source: Enable
ro_ro: Activează

source: Use Select2
ro_ro: Folosește Select2

source: Hide filter if taxonomy is blank
ro_ro: Ascunde filtrul dacă taxonomia e goală

source: Taxonomy Filters Management
ro_ro: Management Filtre taxonomii

source: Choose hidden taxonomy terms for the user. By default, all taxonomy terms are visible in the hierarchical term taxonomies sections inside admin pages. You can choose only from max 2 nested levels but all the children of a hidden term are automatically removed from admin pages. Keep in mind that the hidden terms are not searchable and filterable. Only taxonomies with at least one term are shown below.
ro_ro: Alegeți termenii de taxonomie ascunși acestui utilizator. În mod implicit toți termenii sunt afișați în secțiunile de taxonomii ierarhice in paginile de administrare. Copii termenilor aleși nu vor fi afișați. Doar taxonomiile cu cel puțin un termen vor fi afișate mai jos.

source: Hidden terms
ro_ro: Termeni ascunși

source: Taxonomy:
ro_ro: Taxonomia:

source: Show only the selected items
ro_ro: Afișare doar termenii selectați

source: Only selected
ro_ro: Doar selectate

source: Show only the items that are not assigned to the current post-type (0)
ro_ro: Afisare doar termenii nealocati la tipul de articol curent (0)

source: Hide allocated
ro_ro: Ascunde alocate

source: Hide items with no items assigned from other post-types [0]
ro_ro: Ascunde termenii fără asocieri la alte tipuri de articol [0]

source: Hide empty
ro_ro: Ascunde goale

source: Select all visible items
ro_ro: Selectare toți termenii afișați

source: Select all
ro_ro: Selectează tot

source: Deselect all visible items
ro_ro: Deselectare toți termenii afișați

source: Deselect all
ro_ro: Deselectează tot

source: Visible:
ro_ro: Visibile:

source: Selected:
ro_ro: Selectate:

source: Filter
ro_ro: Filtrare

source: Settings
ro_ro: Setări
